application/studio/app/controllers/agendas_controller.rb

SELECT * FROM "agendas" WHERE ("agendas"."id" = 1)
---
  def show
    @agenda = Agenda.find(params[:id])

SELECT * FROM "agendas" WHERE ("agendas"."id" = 1)
---
  def edit
    @agenda = Agenda.find(params[:id])

SELECT * FROM "services" WHERE ("services"."id" = 1)
INSERT INTO "agendas" ("duration", "created_at", "total_price", "updated_at", "service_id", "start", "room", "status", "band_id") VALUES(3, '2010-06-10 22:07:27', 30.0, '2010-06-10 22:07:27', 1, '2010-06-16 13:00:00', 1, 'done', 1)
---
  def create
    @agenda = Agenda.new(params[:agenda])
    @agenda.status = "reserved"
    @agenda.total_price = 0
    @bands = Band.find(:all)
    @services = Service.find(:all)

    respond_to do |format|
      if @agenda.save

SELECT * FROM "agendas" WHERE ("agendas"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "agendas" SET "updated_at" = '2010-06-10 22:08:14', "start" = '2009-06-16 13:00:00', "status" = 'reserved' WHERE "id" = 1
---
  def update
    @agenda = Agenda.find(params[:id])
    @bands = Band.find(:all)
    @services = Service.find(:all)

    respond_to do |format|
      if @agenda.update_attributes(params[:agenda])