application/studio/app/controllers/bands_controller.rb

  def show
    @band = Band.find(params[:id])
---
SELECT * FROM "bands" WHERE ("bands"."id" = 1)

  def edit
    @band = Band.find(params[:id])
---
SELECT * FROM "bands" WHERE ("bands"."id" = 1)

  def create
    @band = Band.new(params[:band])

    respond_to do |format|
      if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "homepage", "login", "password", "style") VALUES('Pearl Jam', '2010-06-10 03:55:05', '2010-06-10 03:55:05', 'www.pearljam.com', 'pearl_jam', '12345', 'Rock')

  def update
    @band = Band.find(params[:id])

    respond_to do |format|
      if @band.update_attributes(params[:band])
---
SELECT * FROM "bands" WHERE ("bands"."id" = 1)
UPDATE "bands" SET "updated_at" = '2010-06-10 03:38:37', "homepage" = '', "password" = '12345', "style" = '' WHERE "id" = 1