application/studio/app/controllers/clients_controller.rb

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM "clients"
---
  def new
    @client = Client.new
    @people = Person.find(:all)
    @clients = Client.find(:all)

    @clients.each do |client|

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def edit
    @client = Client.find(params[:id])

SELECT * FROM "clients"
INSERT INTO "clients" ("created_at", "updated_at", "person_id", "login", "password") VALUES('2010-06-10 21:00:07', '2010-06-10 21:00:07', 2, 'diguliu', '12345')
---
  def create
    @client = Client.new(params[:client])
    @people = Person.find(:all)
    @clients = Client.find(:all)

    @clients.each do |client|
      @people.delete_if {|person| person.id == client.person_id}
    end

    respond_to do |format|
      if @client.save

SELECT * FROM "clients" WHERE ("clients"."id" = 3)
---
  def update
    @client = Client.find(params[:id])

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
DELETE FROM "clients" WHERE "id" = 1
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy