application/studio/app/controllers/equips_controller.rb

SELECT * FROM "equips" WHERE ("equips"."id" = 1)
---
  def show
    @equip = Equip.find(params[:id])

SELECT * FROM "equips" WHERE ("equips"."id" = 1)
---
  def edit
    @equip = Equip.find(params[:id])

INSERT INTO "equips" ("model", "internal_price", "created_at", "updated_at", "description", "classification", "external_price") VALUES('Les Paul', 3.0, '2010-06-10 23:26:00', '2010-06-10 23:26:00', '', 'Guitar', 20.5)
---
  def create
    @equip = Equip.new(params[:equip])

    respond_to do |format|
      if @equip.save

SELECT * FROM "equips" WHERE ("equips"."id" = 1)
---
  def update
    @equip = Equip.find(params[:id])

SELECT * FROM "equips" WHERE ("equips"."id" = 1)
DELETE FROM "equips" WHERE "id" = 1
---
  def destroy
    @equip = Equip.find(params[:id])
    @equip.destroy