application/studio/app/controllers/people_controller.rb

INSERT INTO "people" ("name", "address", "created_at", "cpf", "updated_at", "gender", "phone1", "phone2", "email") VALUES('Rodrigo', 'alksdjflk', '2010-06-09 16:51:40', '03076884530', '2010-06-09 16:51:40', 'male', '', '', 'diguliu@gmail.com')
---
  def create
    @person = Person.new(params[:person])

    respond_to do |format|
      if @person.save
        current_user.people << @person