application/studio/app/controllers/services_controller.rb

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def edit
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def update
    @service = Service.find(params[:id])

    respond_to do |format|
      if @service.update_attributes(params[:service])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "services" SET "updated_at" = '2010-06-10 22:46:58', "price" = 20.0, "description" = '' WHERE "id" = 1